commands_templates/DeleteCertificate0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/advancedsecurity/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:DeleteCertificate>
         <!--type: CertificateID-->
         <wsdl:CertificateID>?</wsdl:CertificateID>
      </wsdl:DeleteCertificate>
   </soap:Body>
</soap:Envelope>